app/controllers/newsletters_controller.rb

SELECT * FROM "newsletters" WHERE ("newsletters"."id" = 2)
---
  def show
    @newsletter = Newsletter.find(params[:id])

SELECT * FROM "newsletters" WHERE ("newsletters"."id" = 4)
---
  def display
    @newsletter = Newsletter.find(params[:id])

SELECT * FROM "newsletters" WHERE ("newsletters"."id" = 2)
---
  def edit
    @newsletter = Newsletter.find(params[:id])

SELECT * FROM "newsletters" WHERE ("newsletters"."id" = 16)
---
  def update
    @newsletter = Newsletter.find(params[:id])

SELECT * FROM "newsletters" WHERE ("newsletters"."id" = 1)
DELETE FROM "newsletters" WHERE "id" = 1
---
  def destroy
    @newsletter = Newsletter.find(params[:id])
    @newsletter.destroy