app/controllers/upload_controller.rb

  def save
    if verify
      @newsletter = Newsletter.new(params[:newsletter])
      if @newsletter.save
---
INSERT INTO "newsletters" ("name", "month", "updated_at", "year", "created_at", "data") VALUES('Waterlilies.jpg', 6, '2010-05-30 22:29:39', 2010, '2010-05-30 22:29:39', 'ÿØÿà%00JFIF%00%00`%00`%00%00ÿí.Photoshop 3.0%008BIMí

  def newsletter
    @newsletter = Newsletter.find(params[:id])
---
SELECT * FROM "newsletters" WHERE ("newsletters"."id" = 1)

  def show
    @newsletter = Newsletter.find(params[:id])
---
SELECT * FROM "newsletters" WHERE ("newsletters"."id" = 1)